pgbench/old/lvmraid/raid5_with_custom_postgres_conf
root@lxc-super02 /dev # vgcreate lvmraid5_nvme /dev/nvme2n1 /dev/nvme3n1 /dev/nvme4n1
  Physical volume "/dev/nvme2n1" successfully created.
  Physical volume "/dev/nvme3n1" successfully created.
  Physical volume "/dev/nvme4n1" successfully created.
  Volume group "lvmraid5_nvme" successfully created
root@lxc-super02 /dev # lvcreate --type raid5 -l 100%FREE --nosync -n lv_lvmraid5_nvme lvmraid5_nvme
  Using default stripesize 64.00 KiB.
  Rounding size (2747121 extents) down to stripe boundary size (2747120 extents)
  WARNING: New raid5 won't be synchronised. Don't read what you didn't write!
  Logical volume "lv_lvmraid5_nvme" created.
                                                                                          
root@lxc-super02 /dev # mkdir -p /lv_lvmraid5_nvme

root@lxc-super02 /dev # mount /dev/lvmraid5_nvme /lv_lvmraid5_nvme
root@lxc-super02 /dev # mkfs.ext4 /dev/lvmraid5_nvme/lv_lvmraid5_nvme
root@lxc-super02 /dev # mount /dev/lvmraid5_nvme/lv_lvmraid5_nvme /lv_lvmraid5_nvme
root@lxc-super02 /dev # rm -rf /var/lib/snapd/hostfs/lv_lvmraid5_nvme/*
root@lxc-super02 /dev # lxc storage create lv_lvmraid5_nvme dir source=/lv_lvmraid5_nvme
Storage pool lv_lvmraid5_nvme created
root@lxc-super02 /dev # lxc init 23b29233ca2c u18-pgbench-lvmraid5 -s lv_lvmraid5_nvme
Creating u18-pgbench-lvmraid5



lxc config edit u18-pgbench-lvmraid0

  limits.cpu: "4"
  limits.memory: 16GB


/etc/postgresql/13/main/postgresql.conf

shared_buffers = 8GB
#huge_pages = try
work_mem = 32MB
maintenance_work_mem = 1GB
dynamic_shared_memory_type = posix

wal_level = replica      # minimal, replica, or logical
max_wal_senders = 3
checkpoint_timeout = 1200        #default = 300 (5 min)
wal_compression = on
max_wal_size = 8GB
min_wal_size = 80MB

postgres@u18-pgbench-lvmraid5-settings:~# pgbench -h 127.0.0.1 -p 5432 -U postgres -i -s 150 benchmark
Password:
dropping old tables...
creating tables...
generating data (client-side)...
15000000 of 15000000 tuples (100%) done (elapsed 17.49 s, remaining 0.00 s)
vacuuming...
creating primary keys...
done in 57.30 s (drop tables 21.65 s, create tables 0.01 s, client-side generate 18.37 s, vacuum 2.85 s, primary keys 14.42 s).


postgres@u18-pgbench-lvmraid5-settings:~# pgbench -h 127.0.0.1 -p 5432 -U postgres -i -s 15000 benchmark

Password:
dropping old tables...
creating tables...
generating data (client-side)...
1500000000 of 1500000000 tuples (100%) done (elapsed 2133.02 s, remaining 0.00 s))
vacuuming...
creating primary keys...
done in 4394.09 s (drop tables 0.39 s, create tables 0.01 s, client-side generate 2146.66 s, vacuum 610.43 s, primary keys 1636.61 s).


postgres@u18-pgbench-lvmraid5-settings:~# pgbench -h 127.0.0.1 -p 5432 -U postgres  -T 90 -j 2 benchmark
Password:
starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 15000
query mode: simple
number of clients: 1
number of threads: 1
duration: 90 s
number of transactions actually processed: 31419
latency average = 2.865 ms
tps = 349.097307 (including connections establishing)
tps = 349.142491 (excluding connections establishing)


postgres@u18-pgbench-lvmraid5-settings:~# pgbench -h 127.0.0.1 -p 5432 -U postgres -T 30 -j 2 -S -c 4 benchmark
Password:
starting vacuum...end.
transaction type: <builtin: select only>
scaling factor: 15000
query mode: simple
number of clients: 4
number of threads: 2
duration: 30 s
number of transactions actually processed: 195523
latency average = 0.614 ms
tps = 6517.283023 (including connections establishing)
tps = 6520.342297 (excluding connections establishing)